In [1]:
people = {
    'First' : ['Jasim', 'Shanto', 'Abdur', 'Jewel'],
    'Last'  : ['Uddin', 'Rahman', 'Rahim', 'Mahmud'],
    'Email' : ['jasimcse@gmail.com', 'rakibcse@gmail.com', 'tamimcse@gmail.com', 'jewelcse@gmail.com']
}

In [2]:
people

{'First': ['Jasim', 'Rakib', 'Tamim', 'Jewel'],
 'Last': ['Uddin', 'Hasan', 'Hasan', 'Mahmud'],
 'Email': ['jasimcse@gmail.com',
  'rakibcse@gmail.com',
  'tamimcse@gmail.com',
  'jewelcse@gmail.com']}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

   First    Last               Email
0  Jasim   Uddin  jasimcse@gmail.com
1  Rakib   Hasan  rakibcse@gmail.com
2  Tamim   Hasan  tamimcse@gmail.com
3  Jewel  Mahmud  jewelcse@gmail.com

In [6]:
df.columns

Index(['First', 'Last', 'Email'], dtype='object')

In [8]:
df.columns = ['first_name','last_name', 'email']

In [9]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [12]:
df.loc[0,['email','last_name']]

email        jasimcse@gmail.com
last_name                 Uddin
Name: 0, dtype: object

In [13]:
df.columns = [x.upper() for x in df.columns]

In [14]:
df

  FIRST_NAME LAST_NAME               EMAIL
0      Jasim     Uddin  jasimcse@gmail.com
1      Rakib     Hasan  rakibcse@gmail.com
2      Tamim     Hasan  tamimcse@gmail.com
3      Jewel    Mahmud  jewelcse@gmail.com

In [19]:
df.columns = df.columns.str.replace('_', ' ')

In [22]:
#df

In [21]:
df.columns = df.columns.str.replace(' ', '_')
df

  FIRST_NAME LAST_NAME               EMAIL
0      Jasim     Uddin  jasimcse@gmail.com
1      Rakib     Hasan  rakibcse@gmail.com
2      Tamim     Hasan  tamimcse@gmail.com
3      Jewel    Mahmud  jewelcse@gmail.com

In [24]:
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name               email
0      Jasim     Uddin  jasimcse@gmail.com
1      Rakib     Hasan  rakibcse@gmail.com
2      Tamim     Hasan  tamimcse@gmail.com
3      Jewel    Mahmud  jewelcse@gmail.com